[{"title":"Our Beliefs","body_content":"\n## The Bible\n\nWe believe in the infallible, inspired Word of God. We accept the Textus Receptus manuscripts as the foundational material from which we derive the King James 1611. The Old and New Testament Scriptures were written by human authors divinely inspired by the Holy Spirit, preserved, unbroken and passed down to us today. The Scripture is the final Authority in all matters of faith and practice. *(II Timothy 3:16; Psalm 119:89; II Peter 1:20,21)*\n\n## Creation\n\nWe believe the Genesis account of creation, and that what one believes about his origin will determine his philosophy of life. We believe creation was a direct act of God, in six literal 24 hour solar days, instantaneous and miraculous. We believe man was created in the image of God and all reproduction was “after their kind.” *(Genesis 1:1; Colossians 1:16-17; Job 26:7; Psalm 33:6,9; John 1:3)*\n\n## The Trinity\n\nWe believe God is a Person, eternally existing; one true God, but in the unity of the Godhead. There are three eternal and co-equal Persons: God the Father, God the Son, and God the Holy Spirit. One Godhead made up of three Persons Who are the same in attributes, power, characteristics, and desires. *(Hebrews 1:8; Acts 5:1-3; Matthew 28:19; I Corinthians 8:6; Colossians 2:9; Matthew 3:16,17)*\n\n## The Son of God\n\nJesus Christ, eternally existing, is the only begotten Son of God. He became a man totally apart from sin, being conceived by the Holy Spirit and born of the virgin Mary, and is true God and true man. *(Luke 1:30-35; John 1:1-15; Philippians 2:5-8; Colossians 1:15)*\n\n## Sin\n\nMan was created in the image of God but fell through sin, bringing not only physical death but also spiritual death–separation from God. Now all mankind is totally depraved, having inherited a sinful nature, is bent toward sinning, and has become sinful in thought, word, and deed. *(Genesis 1:26,27; 2:16,17; 3:16-19; Romans 3:10-23; 6:23)*\n\n## Blood Atonement\n\nThe Lord Jesus Christ suffered and died as a substitutionary sacrifice for the sins of the whole world. He arose from the dead in the body in which He was crucified. He ascended into Heaven in the glorified body, where He is seated at the right hand of God the Father as Head of the Church, making intercession for the saints as our High Priest. *(Luke 24; Acts 1:9-11; Romans 5:8-10; Ephesians 1:20-23; I Peter 3:18)*\n\n## Salvation\n\nMan is lost and must be born again to enter the Kingdom of God. Salvation is by grace alone through personal faith in the finished work of Christ on the cross. *(John 1:12; 3:3-7; Ephesians 2:8,9)*\n\n## The Second Coming\n\nThe Lord Jesus Christ Himself is coming again in the air at any moment to “rapture” up those that have received Him as their Personal Saviour and to reward their service. The unbelievers left behind will go through a period called the Tribulation, after which Christ shall return visibly to the earth to set up His Kingdom of one thousand years of righteous rule. After this, the unbelievers of all ages will stand at the Great White Throne to be judged and cast into the Lake of Fire, separated from God forever, while the believers spend eternity in the fullness of joy in Heaven with the Lord. *(Matthew 24:29-42; I Thessalonians 4:16-18; Revelation 19:11 - 20:15)*\n\n## Separation from the World\n\nWe believe that all the saved are called unto a life of separation from all worldly and sinful practices. A person, once he has truly accepted Christ as Saviour, is a new creation in Christ and should live a holy, consecrated life. He should separate himself from the world and all its lust in obedience to the command of God. *(Romans 12:1-2; I John 2:15-17; II Corinthians 5:17; 6:14-18; I Peter 2:9; II Timothy 2:19)*\n\n## The Local church\n\nWe believe that a Scriptural church is a visible assembly of baptized (immersed) believers, covenanted together under New Testament law for the purpose of carrying out the Great Commission, with an unbroken history from the personal ministry of Jesus on earth to this present day; that this church is a self-governed independent body having Christ as the Head, the Holy Spirit for its Guide, and the Bible as the only rule of faith and practice. The only Scriptural offices of the church are the bishop (Pastor) and deacons. The two ordinances of the local church are Baptism and Lord’s Supper. On all matters of membership, of policy, of government, of discipline, of benevolence, etc. the will of the local church is final. *(Mk. 16:15; Eph. 1:22-23; 3:21; I Tim. 3)*","ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Our Pastor","body_content":"![](http://dl.dropbox.com/u/47159282/ourpastor%202.png)\n\nSean Hicks is the pastor and founder of the Blessed Hope Baptist Church in Mt. Vernon IL. He is a graduate of Faith Bible Institute and currently working at earning a PhD through Baptist College of America.\n\nPastor Sean Hicks is a Bible teacher and preacher. Each service at Blessed Hope Baptist Church is different in subject matter and delivery. Whether you are a seasoned believer or a new convert, Pastor Hicks sees to it that everyone is fed from the Word of God. He enjoys both expository and topical preaching.\n\nPastor Hicks was saved in 1985 at the age of 11. In 1994 he married his high school sweetheart Angela. In 1995 he joined the U.S. Marine Corps. Since that time, Pastor Hicks and wife Angela have had 3 children of their own, 2 daughters and a son, as well as foster parents of 2 boys.\n\nFrom 1998-2004, Sean did not walk with the Lord nor was he following God’s will for his life. For 6 years Sean played lead guitar in the local hard rock/heavy metal band “Disturbing The Peace” which also contributed to being an alcoholic. In late 2004, with the insistent pleas of his wife, Sean attended a church service at the same church he was saved at as a bus kid nearly 20yrs prior. Upon hearing a message called “Deadbeat Christians” and coming under heavy conviction, Sean went forward during the alter call, repented and rededicated his life to Christ. From that moment, Sean quit his band, quit drinking alcohol and began faithfully attending church.\n\nIn 2006, after much wrestling, Sean surrendered to the call to preach and in 2007 he was licensed to preach the Gospel by the pastor and leadership board of the church. Sean began guest speaking, filling in for the pastor when asked and began preaching regularly at a local drug rehab. In 2008 he was asked to pastor the White Swan Baptist Church in Woodlawn IL. Later that same year pastor Sean was ordained by his sending church.\n\nIn 2010, Pastor Sean felt he was being led of the Lord to start an Independent Fundamental Baptist church in the Mt. Vernon area. By 2012 Blessed Hope Baptist Church was born. Today Pastor Sean Hicks and his wife Angela continue to serve the Lord at BHBC. In addition to pastoring the church, Pastor Hicks still preaches at the drug rehab every week where he has led more than 1,000 people to the saving grace of the Lord Jesus Christ. Other ministries include an outreach to Heritage Woods Assisted Living Center and director of Faith Bible Institute where the church serves as the Mt .Vernon college campus.\n\n\nPastor Sean Hicks has a passion to see souls saved, lives changed and families restored through the power of Christ and His Word. One of Pastor Hicks’ life verses is found in Psalm 71:17-18 *“O God, thou hast taught me from my youth: and hitherto have I declared thy wondrous works. Now also when I am old and grayheaded, O God, forsake me not; until I have shewed thy strength unto this generation, and thy power to every one that is to come.”*","featured_image":[{"id":"att0KZmrsS1hGnKtp","url":"https://dl.airtable.com/SZGGxhlnRE2XYsrMpR6m_leadership_header.jpg","filename":"leadership_header.jpg","size":400123,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/Uxn1ua3fRHusy72ZJirp_small_leadership_header.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/Ks8HJn1RWykHurqbjNIe_large_leadership_header.jpg","width":512,"height":512}}}],"type":"Leadership ","updated_at":"2016-07-11","published":true,"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Gospel","body_content":"\n# The Bible Way To Heaven\n\nThere are big questions that haunt all of us. What happens when I die? Where will I spend eternity? The single most important question that you will ever answer is this - “If I were to die today, would I spend eternity in Heaven with God?” Your relationship to Jesus Christ is central to the answer to that question.\n\nThe Bible tells us in I John 5:13, *“These things have I written unto you that believe on the name of the Son of God; that ye may know that ye have eternal life...”* The simple truth is God wants you to know where you're going! So, here it is in a nutshell:\n\n## 1. Recognize Your Condition\n\nOur sin creates an impassable chasm between us and eternal life with God.\n\nMy biggest mistake when I don’t know my way is that I don’t want to admit that I am lost! My wife calls this, “pride.” In order to find the way to eternal life with God, I must admit I am lost in sin. Romans 5:12 teaches us that since Adam and Eve, the first man and woman on earth, a sin nature has been present in all people. Romans 3:23 says, *“For all have sinned, and come short of the glory of God.”* Sin is any act contrary to God’s laws and commandments, and those sins that I have committed separate me from God. Whenever I have been lost, I have paid some type of penalty. I have been late to a special event and, on occasion, I have received a speeding ticket. Sin also has a penalty. Romans 6:23 says, *“For the wages of sin is death; but the gift of God is eternal life through Jesus Christ our Lord.”* The “wage” or payment for our sin is spiritual death, and eternal separation from God.\n\n## 2 Religion and Good Works Are Not the Answer\n\nReligion and good works cannot bridge the gap created by our sin.\n\nReligions try to create their own ways to God. Their systems may seem logical, but they cannot bridge the gap created by our sin. Proverbs 14:12 says, *“There is a way which seemeth right unto a man, but the end thereof are the ways of death.”* In other words, our thoughts and ways are not what matter. God’s Word, the Bible, provides true answers of grace and forgiveness. In Ephesians 2:8–9 the Bible says, *“For by grace are ye saved through faith; and that not of yourselves: it is the gift of God: Not of works, lest any man should boast.”*\n\n## 3 The Good News—Jesus Christ Provides the Way!\n\nThrough His death on the cross, Jesus Christ paid for our sins and delivers to us the way to eternal life in Heaven.\n\nEven though we were lost and separated from God, He loved us, and because He is love, God sent His Son to die on the Cross and raise from the dead three days later. John 3:16 explains *“For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.”* Through the death and resurrection of Jesus, He became the payment for our sin. Now, we do not have to pay for our sin ourselves. By His grace, salvation is provided. In Romans 5:8, the Bible says, *“But God commendeth [meaning proved or demonstrated] his love toward us, in that, while we were yet sinners, Christ died for us.”*\n\n## 4 Believe and Receive Christ\n\nWe must place our full trust in Jesus Christ alone for forgiveness and eternal life.\n\nIn order to have a relationship with God and an eternal home in Heaven, we must stop trusting ourselves, our works, and our religions, and place our full trust in Jesus Christ alone for the forgiveness of our sin and eternal life. In Roman 10:13 the Bible says, *“For whosoever shall call upon the name of the Lord shall be saved.”* That is a promise directly from God that if you will pray to Him, confess that you are a sinner, ask Him to forgive your sins, and turn to Him alone to be your Saviour; He promises to save you and give you the free gift of eternal life. You can make that decision today by praying from your heart, something like this:\n\n> Dear God, I know that I am separated from you because of sin. I confess that in my sin, I cannot save myself. Right now, I turn to you alone to be my Saviour. I ask you to save me from the penalty of my sin, and I trust you to provide eternal life to me.\n\n> —Amen\n\nYou'll never regret that decision! If you have just trusted Christ, we would love to know about your decision and give you a Bible and some other materials to help you learn more about that new relationship! Give us a call and let us know today!\n","published":true,"ten_minutes":0,"updated_or_created_ten_minutes":0}]
