[{"title":"Have You Been Through The Wash?","body_content":"Dirty or Clean?\n\nWhen I was a child we couldn't always afford new clothes, sometimes we bought used clothes or we whore hand-me-down clothes. Regardless of how we got our clothes and the condition in which they came, they got washed before we would use them. Do you throw away your new or used clothes when they get dirty? Of course not. When our clothes get dirty, we know that they are not good to be used in that condition but they are not all together useless. They simply need to be cleaned and in so doing they are fit to be used again. So it is with us. When it comes to what it takes to be a Christian and what it takes to be a good Christian; it's not the absence of certain sins, it's the presence of forgiveness for them all. Only Christ can give you a new identity, a new life and life eternal. Christ can take the old and make it new again, the filthy and make it clean! There is only One who can wash away our sins! Christ Jesus! Have you been to the sin stain remover? Go to Jesus and be made clean! In so doing, He will make you usable again! \n\n“Know ye not that the unrighteous shall not inherit the kingdom of God? Be not deceived: neither fornicators, nor idolaters, nor adulterers, nor effeminate, nor abusers of themselves with mankind, Nor thieves, nor covetous, nor drunkards, nor revilers, nor extortioners, shall inherit the kingdom of God. And such were some of you: but ye are washed, but ye are sanctified, but ye are justified in the name of the Lord Jesus, and by the Spirit of our God.” - 1Corinthians 6:9-11 KJV\n\nSince that time, have you gotten filthy again? Like our clothes, we often find ourselves having gotten dirty again. When that happens it's time to go through the wash again! Not to be resaved, but to be renewed. 1John 1:9 \"If we confess our sins, he is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness.\"  \n\n![13700133_1279386538753226_8382234148059326664_n.jpg](/storage/app/uploads/public/579/eaa/612/579eaa612dea7421187810.jpg)","featured_image":[{"id":"attqul9TAGGV17rlE","url":"https://dl.airtable.com/elSgbpFVQPCvVGWKciDE_579ec26a93083622382250.jpg","filename":"579ec26a93083622382250.jpg","size":29317,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/J4L01L7TWuSBjBH7qCpP_small_579ec26a93083622382250.jpg","width":38,"height":36},"large":{"url":"https://dl.airtable.com/pwBYDVufQ9GsQ3tBcNg1_large_579ec26a93083622382250.jpg","width":512,"height":512}}}],"categories":["Articles"],"author":["recFqD0VK8UCC2lo7"],"date_added":"2016-07-31","published":true,"author_name":["Pastor Sean Hicks"],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Value of Wisdom","body_content":"![2516367-hand-print-with-not-allowed-don-t-touch-vector-Stock-Vector.jpg](/storage/app/uploads/public/579/ec3/bec/579ec3bec89fa769589021.jpg)\nProverbs 3:13-16 _“Happy is the man that findeth wisdom, and the man that getteth understanding. For the merchandise of it is better than the merchandise of silver, and the gain thereof than fine gold. She is more precious than rubies: and all the things thou canst desire are not to be compared unto her. Length of days is in her right hand; and in her left hand riches and honour.”_\n\nThe above Scriptures show us the value of wisdom. Often it is with the treasure of wisdom as it is with the treasures of precious metals and stones. The journey is not free and the labors can be painful, yet the rewards are grand.\n\nAs we make this pilgrimage to our heavenly home, we will have times of troubles. Acts 14:22 _“Confirming the souls of the disciples, and exhorting them to continue in the faith, and that we must through much tribulation enter into the kingdom of God.”_\n\nThat Scripture is a sober reminder of how the Christian life is not easy but is not without its rewards. In relation to our text, wisdom is gained through our trials and tribulations. Much of what we have learned has come by our experiences.\n\nLet me illustrate:\n\nA little girl was in the kitchen with her mother while she was cooking. The mother needed to check on the laundry so she told her daughter “Don’t touch the oven.” “Why not?” asked the little girl. “Because it’s hot and it will burn you.” Said the mother. The little girl waited until her mom went into the other room, looked at the stove, stood close to it, waved her hands closely in front of it. “It’s just warm” she thought to herself. So she reached out the palm of her hand and touches the oven. She screams out in fearful shock and in great pain as the oven burns the palm of her little hand. She starts crying. Her mother comes in picks her up, comforts her and tends to her wound. A few days later they are cooking in the kitchen together as before. The mother tells her daughter as she leaves the room, “Don’t touch the oven again.” The little girl stands there and begins to wonder if she could try it again and not be burned. Not wanting to risk it she chooses to obey her mother.\n\nIt was at that point the little girls learning had come full circle. When she was warned she obtained knowledge, when she touched it she obtained understanding, and when she chose not to repeat her actions she obtained wisdom.\n\nHave you come full circle concerning the things that harm you?","featured_image":[{"id":"attDJKUmBjCL4kutO","url":"https://dl.airtable.com/5JruiGYUTGWvoHBNH23Q_56c634a1c3280566939153.jpg","filename":"56c634a1c3280566939153.jpg","size":12597,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/qqj8J0fkTTySSXoqBoN8_small_56c634a1c3280566939153.jpg","width":54,"height":36},"large":{"url":"https://dl.airtable.com/6ePckCPUSTaw2yj48UAn_large_56c634a1c3280566939153.jpg","width":512,"height":400}}}],"categories":["Articles"],"author":["recFqD0VK8UCC2lo7"],"date_added":"2015-09-13","published":true,"author_name":["Pastor Sean Hicks"],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"The Land of Nod","body_content":"With the committing of sin we see a pattern which has remained unchanged since the Garden; rebel, hide, blame shift and or completely deny.\n\nEve disobeyed God and took part of what she was warned not too. Adam willingly followed along. Then they hid themselves. When God confronted Adam, Adam blamed Eve and God.\n\nThen later we come to Cain. When God refused to accept Cain's offering because it was not what God had commanded that he bring, Cain got angry with God. The Lord asked him _\"Why art thou wroth? and why is thy countenance fallen?\"_\n\nIt is a dangerous place to be when we find ourselves shocked and angry when we are rebuked for willfully sinning against God.\n\nThe Lord goes on to ask him _\"If thou doest well, shalt thou not be accepted?\"_ Sometimes we feel as if we have been treated unfairly when rejected for our sin. But the Lord reminds Cain that if he had done right, there wouldn't be an issue but since he chose to disobey he should not be shocked for being rejected.\n\nThe Lord finishes by saying _\"and if thou doest not well, sin lieth at the door. And unto thee shall be his desire, and thou shalt rule over him.”_\n\nThis is a sad commentary of the sin nature we all have, and if gone unforgiven by refusal to confess our sin and to remain unrepentant (unchanged) it will ultimately lead to its control over us.\n\nThus, Cain went further down the road of sin unto the point of killing his own brother. Why? Because he hated the righteousness of his brother. Though Cain had the same exposure to God and the same expectations to obey the things of God as did his brother Abel, he chose to rebel, hide, blame-shift and justify his sin. Attacking your brothers and sisters in Christ for trying to help you, and hating them for it is a sure sign of a very dangerous fall.\n\nAnd so it is lastly said of Cain, that he _\"went out from the presence of the Lord\"_. So it is with all who rebel and refuse to repent. You cannot embrace sin and walk with the Savior. As Cain went away from the presents of the Lord, it is said he dwelt in the land of Nod. There are always people and places to dwell among that are ungodly.\n\nWhere do you dwell today? Are you walking with God and His people or have you drifted to the land of Nod?\n\nRepent and return.","featured_image":[{"id":"attYQ9LR8gM91WuG3","url":"https://dl.airtable.com/NQoF4kYQEC5KKGnqoY97_579ec404b2c8b479330654.jpg","filename":"579ec404b2c8b479330654.jpg","size":533618,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/AUmQOJutSdmhX7Nf22yd_small_579ec404b2c8b479330654.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/34wOLds2QDSMijzZzuPZ_large_579ec404b2c8b479330654.jpg","width":512,"height":512}}}],"categories":["Articles"],"author":["recFqD0VK8UCC2lo7"],"date_added":"2015-09-12","published":true,"author_name":["Pastor Sean Hicks"],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"UNSEEN BUT NOT UNFULFILLED","body_content":"In Genesis 23:2a, the Bible tells us of the death of Abraham’s wife Sarah. She had died in Hebron which means she was still in the land of Canaan having died without seeing all the promises of God fulfilled in her lifetime. However, she did see the promise of God by baring her son Isaac. Herein lays the message: It is important to note that such may be true for us as well. We may not live to see all the promises of God that we had hoped too in this life. Or perhaps a dream, vision or goals that we hoped to see fulfilled in our own lifetime but now it appears that time has run short. We need not despair! You will see these things and more.\n\nI recently counseled with a young man who believes the Lord is calling him into the ministry. Not as a preacher but as a musician. He told me his grandfather was a preacher. He had been dying for some time of cancer. He said his grandfather made it a point to reach out to everyone he could before he died. He went to talk with as many family and friends as he could. When he was bed ridden he made phone calls and wrote letters. Things he always wanted to say and people he hoped to reach for Christ could no longer be put off.\n\nIn a bedside conversation with his bed ridden grandfather, this young man told me the last words from his grandfather was not “I love you” or “Be good” and etc. His last words to him were words of warning to repent of his current direction. He was kind and did it in love but he was also very clear. Not long after that conversation his grandfather died. Today that young man is turning his life around to follow Christ’s call upon him. His grandfather died concerned for him and not having seen his grandson’s change. Nevertheless, the hopes that he had for his grandson are now being fulfilled. The grandfather’s heart’s desire was unseen but not unfulfilled.","featured_image":[{"id":"attWYHqOwViElYsPT","url":"https://dl.airtable.com/blYlXZGKQJmt0qsboTNl_56c6350c60b24644051424.jpg","filename":"56c6350c60b24644051424.jpg","size":188979,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/xKRiJX9FTtKM75HOHKmN_small_56c6350c60b24644051424.jpg","width":48,"height":36},"large":{"url":"https://dl.airtable.com/HAyznfQRbu65jFPR1QhQ_large_56c6350c60b24644051424.jpg","width":512,"height":512}}}],"categories":["Articles"],"author":["recFqD0VK8UCC2lo7"],"date_added":"2015-09-11","published":true,"author_name":["Pastor Sean Hicks"],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Weeping For Souls","body_content":"_“But Jesus turning unto them said, Daughters of Jerusalem, weep not for me, but weep for yourselves, and for your children.”_ (Luke 23:28 KJV)\n\nIt is said of the legendary preacher George Whitefield that he would cry from the pulpit and weep to the point he would have to take a moment to regather himself. He is quoted as saying \"You blame me for weeping; but how can I help it, when you will not weep for yourselves, although your own immortal souls are on the verge of destruction, and, for aught I know, you are hearing your last sermon, and may never more have an opportunity to have Christ offered to you?\"\n\nDue to a sober reminder of that truth, I have learned to sorrow in such a way. I recently preached the funeral of a family member who died of a drug overdose. I made a big plea of urgency for salvation. Several accepted Christ. Such a one was a very attractive woman who approached me after the service with her teenage son and stated how much that message meant to her and wanted to know where our church was. A few days later she visited us on a Wednesday night. Before she left she mentioned returning for our Sunday service.\n\nWhen Sunday morning came, she did not come but a police officer did. We were informed that her house was on fire and they were looking for her. The officer returned an hour later to inform us that they found her but unfortunately she was in the house and had perished in the fire.\n\nAlways be mindful that there are going to be those among you to whom you preach, that are hearing their last message. Preach fervently and with a great plea of urgency for those listening to make a decision for Christ. Preach as you are giving your last message to those whom are hearing their last message.\n\nIn deed it is a sober reminder to _\"Boast not thyself of to morrow; for thou knowest not what a day may bring forth.”_ (Proverbs 27:1 KJV)","featured_image":[{"id":"attrEJXcqfqjeACKG","url":"https://dl.airtable.com/lK9A1zBuRiWvcyUpspoR_579ec49c74dc8871335780.jpg","filename":"579ec49c74dc8871335780.jpg","size":39496,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/suF5CThfTjqudfdCBJwx_small_579ec49c74dc8871335780.jpg","width":48,"height":36},"large":{"url":"https://dl.airtable.com/WgvwWvdwRhKFDLJlx1fX_large_579ec49c74dc8871335780.jpg","width":512,"height":500}}}],"categories":["Articles"],"author":["recFqD0VK8UCC2lo7"],"date_added":"2015-09-10","published":true,"author_name":["Pastor Sean Hicks"],"ten_minutes":0,"updated_or_created_ten_minutes":0},{"title":"Don't Tell Me No!","body_content":"Proverbs 27:5 _“Open rebuke is better than secret love.”_\n\nWhen I was a teenager my Nephew Ronny Hicks was just a baby. When I would go places with his mom Karen and his dad Jamie (my big brother) I would often sit with Ronny.\n\nWhen he was around 3yrs old he would ask for certain things or be getting into certain things and I'd have to tell him \"No Ronny.\" One day he says to me in cute kid speech of improper grammar: \"Doe tell me no unk Shaw\". Nevertheless, clearly understood as \"Don't tell me no Uncle Sean.\"\n\nHe was at the age that anything he wanted was good, and anyone keeping him from it was bad.\n\nThat cute story reminds me of something not so cute about our society today. For the past 50-60yrs we have seen America changing. What was once found to be abominable and shameful is now admirable and acceptable.\n\nDrunkenness, drug use, fornication, divorce, children born out of wedlock, abortion, profanity, pornography, immorality and now homosexuality is commonly accepted practices.\n\nAs a Bible believing Christian I adhere to the Word of God and as a preacher I proclaim the Word of God. Once, our society respected preachers because it was commonly understood that \"they watch for your souls, as they that must give account,\" unto God for you.\n\nHowever today as our society continues its tailspin into moral and spiritual depravity there is an increasing anger against the Lord, His Word and His preachers with a resounding cry of \"Don't tell me no!\"\n\nLook friends, there is a real hell with real people in it. There is coming a day when all will stand before God. If you die in your sins unforgiven and unchanged you will go to a place where the fire is never quenched and worm dieth not, where there will be weeping, wailing and gnashing of teeth for an ETERNITY!\n\nTelling people \"no\" to things that you know will destroy them is not hate, but saying nothing is.\n\nGod is love. Not desiring that any should perish but that all should come to repentance. Christ was sent to die in your place. God is love,yes, but He is also holy and He is righteous and He must judge sin.\n\nEither your sin has been placed on Christ account or you still owe a sin debt that you can never pay.\n\nThe Lord wants to save you from your sin, not keep you in it. He wants to liberate you from sin, not give you liberty to sin.\n\nRegardless of what you have done, Christ is willing to save you just as you are, but not to keep you as you are.","featured_image":[{"id":"attEZAJ96O0y2jOCw","url":"https://dl.airtable.com/trgp4TWqT5KXcnHnE3jR_56c6333b21dae552162852.png","filename":"56c6333b21dae552162852.png","size":35580,"type":"image/png","thumbnails":{"small":{"url":"https://dl.airtable.com/i0DF24FeSuqAIkmecJib_small_56c6333b21dae552162852.png","width":54,"height":36},"large":{"url":"https://dl.airtable.com/6YrAC4xSXiQS5zduup0w_large_56c6333b21dae552162852.png","width":512,"height":400}}}],"categories":["Articles"],"author":["recFqD0VK8UCC2lo7"],"date_added":"2015-09-02","published":true,"author_name":["Pastor Sean Hicks"],"ten_minutes":0,"updated_or_created_ten_minutes":0}]
